[[Import]]
== Importing RDF data 

The main method for importing RDF is `semantics.importRDF`. It imports and persists into Neo4j the triples returned by an url. This url can point to an RDF file (local or remote) or a service producing RDF dynamically. More on how to parameterise the access to web services in section x[link]. 

All import procedures take the following three parameters:

[options="header"]
|===
| Parameter        | Type |  Description
| url | String | URL of the dataset
| format | String | serialization format. Valid formats are: Turtle, N-Triples, JSON-LD, TriG, RDF/XML
| params | Map  | Set of parameters (see description in table below)
|===



**Note** that for this method to run, an index needs to exist on property `uri` of nodes labeled as `Resource` so if you have not done it, just run the following command on your DB or the `ssemantics.import` procedure will remind you with an error messsage.

[source,cypher]
----
CREATE INDEX ON :Resource(uri)
---- 

In its most basic form the `semantics.importRDF` method just takes the url string to access the RDF data and the serialisation format. Let's say you're trying to load the following set of triples into Neo4j. 

[source,RDF]
----
@prefix neo4voc: <http://neo4j.org/vocab/sw#> .
@prefix neo4ind: <http://neo4j.org/ind#> .

neo4ind:nsmntx3502 neo4voc:name "NSMNTX" ;
         a neo4voc:Neo4jPlugin ;
         neo4voc:version "3.5.0.2" ;
         neo4voc:releaseDate "03-06-2019" ;
         neo4voc:runsOn neo4ind:neo4j355 .

neo4ind:apoc3502 neo4voc:name "APOC" ;
         a neo4voc:Neo4jPlugin ;
         neo4voc:version "3.5.0.4" ;
         neo4voc:releaseDate "05-31-2019" ;        
         neo4voc:runsOn neo4ind:neo4j355 .

neo4ind:graphql3502 neo4voc:name "Neo4j-GraphQL" ;
         a neo4voc:Neo4jPlugin ;
         neo4voc:version "3.5.0.3" ;
         neo4voc:releaseDate "05/05/19" ;        
         neo4voc:runsOn neo4ind:neo4j355 .                 

neo4ind:neo4j355 neo4voc:name "neo4j" ;
         a neo4voc:GraphPlatform , neo4voc:AwesomePlatform ;
         neo4voc:version "3.5.5" .

----

You can save them to your local drive or access them directly https://raw.githubusercontent.com/jbarrasa/neosemantics/3.5/src/docs/rdf/nsmntx.ttl[here]. All you'll need to provide to NSMNTX is the location (`file://` or `http://`) and the serialisation used, `Turtle` in this case.

[source,cypher]
----
CALL semantics.importRDF("https://raw.githubusercontent.com/jbarrasa/neosemantics/3.5/src/docs/rdf/nsmntx.ttl","Turtle")
----

////
Note that in Windows your path will look something like this, as described here [load csv]
[source,shell]
----
file:///d:/datasets/myfile.ttl
----
////

NSMNTX will import the RDF data and persist it into your Neo4j graph as the following structure

image::nsmntx-annotated.png[RDF data imported in Neo4j]


The first thing you'll notice is that dataType properties in your RDF have been converted into node properties and object properties are now relationships connecting nodes. Every node represents a resource and has a property with its uri. Similarly, rdf:type statements are transformed into node labels. That's pretty much it but if you are interested, there is a complete description of the way triple data is transformed into Property Graph data for storage in Neo4j in https://jesusbarrasa.wordpress.com/2016/06/07/importing-rdf-data-into-neo4j/[this post]. 
You will also notice a terminology/vocabulary transformation applied by default. The URIs identifying the elments in the RDF data (resources, properties, etc) have their namespace part shortened to make them more human readable and easier to query with Cypher. 

In our example, `http://neo4j.org/vocab/sw#name` has been shortened to `ns0____name` (notice the double underscore separator used between the prefix and teh local name in the URI). Similarly, `http://www.w3.org/1999/02/22-rdf-syntax-ns#type` would be shortened to `rdf____type` and so on...

Prefixes for custom namespaces are assigned sequentially (`ns0`, `ns1`, etc) as they appear in the imported RDF. This is the default behavior but we'll see later on that it is possible to control that, and use custom prefixes. More details in section <<custom_ns>>.

Keeping namespaces can be important if you care about being able to regenerate the imported RDF as we will see in section <<Export>>. If you don't care about that, you can ignore the namespaces by setting the `handleVocabUris` parameter to `'IGNORE'` and namespaces will be lost on import. If you run the import with this setting only the local names of URIs will be kept. Here's what that would look like:

[source,cypher]
----
CALL semantics.importRDF("http://.../nsmntx.ttl","Turtle", { handleVocabUris: "IGNORE" })
----

The imported graph will look something like the following one, in which the names for labels, properties and relationships are more of the kind you're use to work with in Neo4j:

image::nsmntx-ignore-annotated.png[RDF data imported in Neo4j ignoring namespaces]


[IMPORTANT]
The first great thing about getting your RDF data into Neo4j is that now you can query it with Cypher

Here's an example that showcases the difference: Let's say you want to produce a _list of plugins that run on Neo4j and what's the latest versions of each_. 

If your RDF data is stored in a triple store, you would need to use the SPARQL query on the left to answer the question. To the right you can see the same thing expressed with Cypher in Neo4j.


|===
|SPARQL |Cypher

a|
[source,sparql]
----
@prefix neovoc: <http://neo4j.org/voc/sw#> .
@prefix neoind: <http://neo4j.org/ind#> .
@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
 
SELECT ?nm as pluginName, 
       (MAX(?ver) as ?version) 
WHERE {

	?plugin rdf:type neovoc:Neo4jPlugin ;
		    neovoc:runsOn ?neosrv ;
		    neovoc:name ?nm ;
		    neovoc:version ?ver .

	?neosrv rdf:type neovoc:GraphPlatform ;
			neovoc:name "neo4j"	    
}
GROUP BY ?plugin
----
a|
[source,cypher]
----
MATCH (n:Neo4jPlugin)-[:runsOn]->(p:GraphPlatform)
WHERE p.name = "neo4j"
RETURN n.name, MAX(n.version)
----
|===

We've seen how to shorten RDF uris into more readable names using namespace prefixes, and we've also seen how to ignore them completely. There is a third option: You can keep the complete uris in property names, labels and relationships in the graph by setting the `handleVocabUris` property to `"KEEP"`. The result will not be pretty and your cypher queries will be horrible, but hey, the option is there. Here's an example on the same RDF file:

[source,cypher]
----
CALL semantics.importRDF("http://.../nsmntx.ttl","Turtle", { handleVocabUris: "KEEP" })
----

image::nsmntx-keep-annotated.png[RDF data imported in Neo4j keeping namespaces]

The imported graph in this case has the same structure, of course, but uses full uris as labels, relationships an property names.


===== Storing categories (classess) as Nodes instead of Labels

The rdf:type statements in RDF (triples) are transformed into labels by default when we import them into Neo4j. While this is a reasonable approach it may not be your preferred option, especially if you want to load an ontology too and link it to your instance data. In that case you'll probably want to represent the types as nodes and have 'the magic' of uris have them linked. Be careful if you try this approach when loading large datasets as it can create very dense nodes. 
If you want `rdf:type` statements (triples) to be imported in this way, all you have to do is set the `typesToLabels` parameter to `false`.

Here's an example: Let's say we want to load an ontology (notice that it's actually a small fragment of several ontologies, but it will work for our example). For what it's worth, it's an RDF file, so we load it the usual way, with all default settings

[source,cypher]
----
call semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/minionto.ttl","Turtle")
----

We can inspect the result of the import to see that the ontology contains just five class definitions linked in a hierarchy like this.

image::minionto.png[Ontology imported in Neo4j]

Now we want to load the instance data and we want it to link to the ontology graph rather than build a disconnected graph by transforming `rdf:type` statements into Property Graph labels. We can achieve this by setting the `typesToLabels` to `false`.

[source,cypher]
----
call semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/miniinstances.ttl","Turtle", { typesToLabels: false })
----

The resulting graph connects the instance data to the ontology elements. This is the magic of unique identifiers (uris), tere's nothing you need to do for the linkage to happen, if your RDF is well formed and uris are used consistently in it, then it will happen automatically. 

image::miniontoandinstances.png[Connected ontology and instance data imported in Neo4j]

More on the usefulness of representing the ontology in the neo4j graph in section <<Inference>>.



==== Filtering triples by predicate

Another thing you can do when your import RDF data into Neo4j is exclude certain triples so that they are not persisted in your Neo4j graph. This is useful when only a portion of the RDF data is relevant to you. The exclusion is done by predicate type __"I don't need to load the version property, or the release date"__, all you'll need to do is provide the list of URIs of the predicates you want excluded in parameter `predicateExclList`. Note that the list needs to contain full URIs.

[source,cypher]
----
CALL semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/nsmntx.ttl","Turtle", { handleVocabUris: "IGNORE" , predicateExclusionList : [ "http://neo4j.org/vocab/sw#version", "http://neo4j.org/vocab/sw#releaseDate"] })
----

==== Handling multivalued properties

In RDF multiple values for the same property are just multiple triples. For example, you can have multiple alternative names for an individual like in the next RDF fragment:

[source,RDF]
----
<neo4j://individual/JB> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://neo4j.org/voc#Person> .
<neo4j://individual/JB> <http://neo4j.org/voc#name> "J. Barrasa" .
<neo4j://individual/JB> <http://neo4j.org/voc#altName> "JB" .
<neo4j://individual/JB> <http://neo4j.org/voc#altName> "Jesús" .
<neo4j://individual/JB> <http://neo4j.org/voc#altName> "Dr J" .
----

NSMNTX default behavior is to keep only one value for literal properties and it will be the last one read in the triples parsed. So if you run a straight import on that data like this

[source,cypher]
----
CALL semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/multivalued1.nt","N-Triples")
----

Only the last value for the multivalued `altName` property will be kept. This makes things simple and will be perfect if your dataset does not have multivalued properties. It can also be fine if keeping only one value is acceptable, either because the property is not critical or because one value is enough. There will be other cases though, where we do need to keep all the values, and here's where the config parameter `handleMultival` will help. 

Let's take for example this Turtle RDF fragment with the description of a news article. The article has a number of keykeywords associated with it. 

[source,RDF]
----
@prefix og: <http://ogp.me/ns#> .
@prefix nyt: <http://nyt.com/voc/> .

<nyt://article/a17a9514-73e7-51be-8ade-283e84a6cd87>
  a og:article ;
  og:title "Bengal Tigers May Not Survive Climate Change" ;
  og:url "https://www.nytimes.com/2019/05/06/science/tigers-climate-change-sundarbans.html" ;
  og:description "The tigers of the Sundarbans may be gone in fifty years, according to study" ;
  nyt:keyword "Climate Change", "Endangered Species", "Global Warming", "India", "Poaching" .
----

We want to make sure we keep all values for the `nyt:keyword` property. The natural way to do this in Neo4j is storing them in an array, so we'll instruct NSMNTX to do that by setting the `handleMultival` to `'ARRAY'` and the `multivalPropList` to the list of property types that are multivalued and we want stored as arrays of values. In the example the list will only contain `'http://nyt.com/voc/keyword'`. 

Here's teh import command that we need. Note that I'm combining the multivalued property config setting with the `handleVocabUris` set to false (the interested reader can try to drop this config and get URIS shortened with prefixes instead):

[source,cypher]
----
CALL semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/backup/docs/rdf/multivalued2.ttl","Turtle", { handleVocabUris: "IGNORE", handleMultival: 'ARRAY', multivalPropList : ['http://nyt.com/voc/keyword']})
----

And here's what the result of the import would look like:

image::multivalued1.png[Multivalued properties loaded as arrays in Neo4j]

When we analyse the result in the Neo4j browser we realise that we had nine triples but there's only one node(!). Yes, keep in mind that all triples in our RDF example are datatype properties, which are stored as node properties in neo4j. All the statements are there, no data is lost, it's just stored as the internal structure of the node. We can see all properties on the table view on the left hand side of the image. 

Note that only the properties listed in the `multivalPropList` config parameter are stored as arrays, the rest are atomic values. 

[WARNING]
Keep in mind that if we set `handleMultival` to `'ARRAY'` but we don't provide a list of property URIs as `multivalPropList` ALL literal properties will be stored as arrays.

And here's an example of how to query the multiple values of the keyword property:  _Give me articles tagged with the "Global Warming" keyword_.

[source,cypher]
----
MATCH (a:article) 
WHERE "Global Warming" IN a.keyword 
RETURN a.title as title
----

[source,cypher]
----
╒══════════════════════════════════════════════╕
│"title"                                       │
╞══════════════════════════════════════════════╡
│"Bengal Tigers May Not Survive Climate Change"│
└──────────────────────────────────────────────┘
----

==== Handling language tags

Literal values in RDF can be tagged with language information. This can be used in any context but it's common to find it used in combination with multivalued properties to create multilingual descriptions for items in a dataset. In the following example we have a description of a TV series with a multivalued property `show:localName` where each of the values is annotated with the language. 

[source,RDF]
----
@prefix show: <http://example.org/vocab/show/> .
@prefix indiv: <http://example.org/ind/> .

ind:218 a show:TVSeries
ind:218 show:name "That Seventies Show" .
ind:218 show:localName "That Seventies Show"@en .                 
ind:218 show:localName 'Cette Série des Années Soixante-dix'@fr . 
ind:218 show:localName "Cette Série des Années Septante"@fr-be . 
----

By default, NSMNTX will strip out the language tags but if you want to keep them you'll need to set the `keepLangTag` to `true`. If we uset it in combination with the setting required to keep all values of a property stored in an array, the import invocation would look something like this:

[source,cypher]
----
CALL semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/multilang.nt","Turtle", { keepLangTag: true, handleMultival: 'ARRAY', multivalPropList : ['http://example.org/vocab/show/localName']})
----

When you import literal values keeping the language annotation, you'll see that string values have a suffix like `@fr` for French language, `@zn` for Chinese traditional, and so on.
The function `getLangValue` can be used to get the value for a particular language tag. It returns null when there is not a value for the selected language tag. 
The following Cypher fragment returns the french version of a property and when not found, defaults to the english version.

[source,cypher]
----
MATCH (n:Resource) RETURN coalesce(semantics.getLangValue("fr",n.ns0__localName), semantics.getLangValue("en",n.ns0__localName))
----

==== Filtering triples by language tag
Language tags can also be used as a filter criteria. If we are only interested in a particular language when loading a multilingual dataset, we can set a filter so only literal values with a given language tag (or untagged ones) are imported into Neo4j. The configuration parameter that does it is `languageFilter` and you'll need to set it to the relevant tag, for instance 'es' for literals in Spanish language. Here's what such a configuration would look like:

[source,cypher]
----
CALL semantics.importRDF("file:///Users/jesusbarrasa/Workspaces/neosemantics/docs/rdf/multilang.nt","Turtle", { languageFilter: 'es'})
----


==== Setting HTTP request parameters for fetching RDF data

Sometimes the RDF data will be a static file, and other times it'll be dynamically generated in response to an HTTP request (`GET` or `POST`) possibly containg parameters, even a SPARQL query.

--> HERE

[#custom_ns]
==== Defining custom prefixes for namespaces

When applying url shortening on RDF ingestion (either explicitly or implicitly), we have the option of letting neosemantics automatically assign prefixes to namespaces as they appear in the imported RDF. But before doing that, a few popular ones will be set with familiar prefixes. These include `"http://www.w3.org/1999/02/22-rdf-syntax-ns#"` prefixed as `rdf` and `"http://www.w3.org/2004/02/skos/core#"` prefixed as `skos`.

At any point you can check the prefixes in use by running the `listNamespacePrefixes` procedure.

[source,cypher]
----
CALL semantics.listNamespacePrefixes()
----

Before running your first import this method should return no results but after your first run, it should return a list containing at least the following entries.

[source,cypher]
----
╒════════╤═════════════════════════════════════════════╕
│"prefix"│"namespace"                                  │
╞════════╪═════════════════════════════════════════════╡
│"skos"  │"http://www.w3.org/2004/02/skos/core#"       │
├────────┼─────────────────────────────────────────────┤
│"sch"   │"http://schema.org/"                         │
├────────┼─────────────────────────────────────────────┤
│"sh"    │"http://www.w3.org/ns/shacl#"                │
├────────┼─────────────────────────────────────────────┤
│"rdfs"  │"http://www.w3.org/2000/01/rdf-schema#"      │
├────────┼─────────────────────────────────────────────┤
│"dc"    │"http://purl.org/dc/elements/1.1/"           │
├────────┼─────────────────────────────────────────────┤
│"dct"   │"http://purl.org/dc/terms/"                  │
├────────┼─────────────────────────────────────────────┤
│"rdf"   │"http://www.w3.org/1999/02/22-rdf-syntax-ns#"│
├────────┼─────────────────────────────────────────────┤
│"owl"   │"http://www.w3.org/2002/07/owl#"             │
└────────┴─────────────────────────────────────────────┘
----

Let's say the RDF dataset that you are going to import uses the namespace `http://neo4j.org/voc/sw#` and you want it to be prefixed as `neo` instead of `ns0` (or `ns7`) as would happen if the prefix was assigned automatically by neosemantics.
You can do this by calling the `addNamespacePrefix` procedure as follows:

[source,cypher]
----
call semantics.addNamespacePrefix("neo","http://neo4j.org/vocab/sw#")
----

This will return:

[source,cypher]
----
╒════════╤════════════════════════════╕
│"prefix"│"namespace"                 │
╞════════╪════════════════════════════╡
│"neo"   │"http://neo4j.org/vocab/sw#"│
└────────┴────────────────────────────┘
----
And then when the namespace is detected during the ingestion of the RDF data, the `neo` prefix will be used.

Make sure you know what you're doing if you manipulate the prefix definition, especially after loading RDF data as you can overwrite namespaces in use, which would affect the possibility of regenerating the imported RDF.



== Previewing RDF data

Sometimes before we go ahead and import RDF data in our Neo4j graph we want to see what it looks like or we may even want to take full control on what to do with each parsed triple. For these purpose NSMNTX provides the following procedures:



|===
| Stored Proc Name        | params           | Description and example usage  
| semantics.importRDF      | <ul><li>URL of the dataset</li><li>serialization format(*)</li><li>map with zero or more params (see table below)</li></ul> | Imports into Neo4j all the triples in the data set according to the structural mapping defined in [this post](https://jesusbarrasa.wordpress.com/2016/06/07/importing-rdf-data-into-neo4j/). <br> **Note** that before running the import procedure an index needs to be created on property uri of Resource nodes. Just run `CREATE INDEX ON :Resource(uri)` on your Neo4j DB. <br>**Examples:**<br>CALL semantics.importRDF("file:///.../myfile.ttl","Turtle", { shortenUrls: false, typesToLabels: true, commitSize: 9000 }) <br> CALL semantics.importRDF("http:///.../donnees.rdf","RDF/XML", { languageFilter: 'fr', commitSize: 5000 , nodeCacheSize: 250000}) 
| semantics.previewRDF      | <ul><li>URL of the dataset</li><li>serialization format(*)</li><li>map with zero or more params (see table below)</li></ul> | Parses some RDF and produces a preview in Neo4j browser. Same parameters as data import except for periodic commit, since there is no data written to the DB.<br> Notice that this is adequate for a preliminary visual analysis of a **SMALL dataset**. Think how many nodes you want rendered in your browser.<br> **Examples:**<br>CALL semantics.previewRDF("[https://.../clapton.n3](https://raw.githubusercontent.com/motools/musicontology/master/examples/clapton_perf/clapton.n3)","Turtle", {}) 
| semantics.streamRDF      | <ul><li>URL of the dataset</li><li>serialization format(*)</li><li>map with zero or more params (see table below)</li></ul> | Parses some RDF and streams the triples as records of the form subject, predicate, object plus three additional fields: <ul><li>a boolean indicating whether the object of the statement is a literal: `isLiteral`</li><li>The datatype of the literal value if available `literalType`</li><li>The language if available `literalLang`</li></ul> This SP is useful when you want to import into your Neo4j graph fragments of an RDF dataset in a custom way.<br> **Examples:**<br>CALL semantics.streamRDF("[https://.../clapton.n3](https://raw.githubusercontent.com/motools/musicontology/master/examples/clapton_perf/clapton.n3)","Turtle", {}) 
| semantics.previewRDFSnippet      | <ul><li>An RDF snippet</li><li>serialization format(*)</li><li>map with zero or more params (see table below)</li></ul> | Identical to previewRDF but takes an RDF snippet instead of the url of the dataset.<br> Again, adequate for a preliminary visual analysis of a SMALL dataset. Think how many nodes you want rendered in your browser :)<br> **Examples:**<br>CALL semantics.previewRDFSnippet('[{"@id": "http://indiv#9132", "@type": ... }]', "JSON-LD", { languageFilter: 'en'}) 
| semantics.liteOntoImport      | <ul><li>URL of the dataset</li><li>serialization(*)</li></ul> | Imports the basic elements of an OWL or RDFS ontology, i.e. Classes, Properties, Domains, Ranges. Extended description [here](https://jesusbarrasa.wordpress.com/2016/04/06/building-a-semantic-graph-in-neo4j/) <br> **Example:**<br>CALL semantics.liteOntoImport("http://.../myonto.trig","TriG")  
| semantics.getIRILocalName      | **[function]**<ul><li>IRI string</li></ul> | Returns the local part of the IRI (stripping out the namespace) <br> **Example:**<br>RETURN semantics.getIRILocalName('http://schema.org/Person')  
| semantics.getIRINamespace      | **[function]**<ul><li>IRI string</li></ul> | Returns the namespace part of the IRI (stripping out the local part) <br> **Example:**<br>RETURN semantics.getIRINamespace('http://schema.org/Person')  
|===




|===
| Param        | values(default)           | Description  
| shortenUrls      | boolean (true) | when set to true, full urls are shortened using generated prefixes for both property names, relationship names and labels 
| typesToLabels      | boolean (true) | when set to true, rdf:type statements are imported as node labels in Neo4j 
| languageFilter      | ['en','fr','es',...] | when set, only literal properties with this language tag (or untagged ones) are imported  
| headerParams      | map {} | parameters to be passed in the HTTP GET request. <br> Example: { authorization: 'Basic user:pwd', Accept: 'application/rdf+xml'} 
| commitSize      | integer (25000) | commit a partial transaction every n triples 
| nodeCacheSize      | integer (10000) | keep n nodes in cache to minimize reads from DB 
|===



[WARNING]
Graph Algorithms (similarity, centrality and clustering) in APOC are deprecated and about to be removed.
Please use the algorithms in https://r.neo4j.com/algo[neo4j-graph-algorithms] instead.


